/**
******************************************************************************
* @file    		ntc_3950.h
* @brief   		ntc_3950 ÎÂ¶È²É¼¯
*
*
* @author			WQG
* @versions   v1.0
* @date   		2024-7-23
******************************************************************************
*/
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __NTC_3950_H__
#define __NTC_3950_H__


#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stdint.h"

	
/* Private includes ----------------------------------------------------------*/


/* Exported types ------------------------------------------------------------*/

/* Exported constants --------------------------------------------------------*/



/* Exported macro ------------------------------------------------------------*/

/* Exported functions prototypes ---------------------------------------------*/


float Get_Internal_Temp(void);
float Get_External_Temp(void);

/* Private defines -----------------------------------------------------------*/




#ifdef __cplusplus
}
#endif

#endif /* __NTC_3950_H__ */

